app/controllers/client_controller.rb

  def index
    @client = Client.all
---
SELECT "client".* FROM "client"

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "client" ("name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Guilherme"], ["email", "guilherme_marc@gmail.com"], ["phone", "47998871902"], ["created_at", "2022-02-18 17:01:53.207408"], ["updated_at", "2022-02-18 17:01:53.207408"]]

    def set_client
      @client = Client.find(params[:id])
---
SELECT  "client".* FROM "client" WHERE "client"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]